{
  "name": "Chitoge",
  "avatar": "",
  "newMember": {
    "private_msg": {
      "header": "Bienvenido al Discord de **<GUILD>**!",
      "intro": "Soy <BOTNAME>, Intento ayudar a la comunidad con tareas para administrar o hacer esto más divertido! Por el momento sigo aprendiendo como ayudar a la comunidad, pero espero ser de ayuda!",
      "body": "Por el momento, sólo tienes acceso al canal de **#leame** (te recomiendo que lo leas) y **#asignacion_de_rol**, donde te asignamos a que estado perteneces y después tendrás acceso a todo el canal! (Usa **!role --explain** para saber como!)",
      "footer": "Para terminar, si necesitas saber en que más te puedo ayudar, intenta usar el comando '!help' y te diré en qué te puedo ayudar!\n\nNuevamente, Bienvenido!\nPor cierto, no ocasiones problemas o te daré una lección personalmente!"
    },
    "guild_msg": {
      "header": "Bienvenid@ **<USERNAME>** al Discord de **<GUILD>**!\n\n",
      "body": "El servidor con todo el Smash de mexicanos para mexicanos (y algunas otras nacionalidades... créeme, también pensamos en eso).\n\n",
      "footer": "Disfruta tu estadia y espero te diviertas con los demás smashers de la comunidad... Y no estés ocasionando problemas o me encargaré personalmente de ti... Y no te va a gustar..."
    }
  },
  "unknownCommand": "Ese comando no existe! No puedes escribir bien un comando o que?! \nSi realmente lo necesitas, talvez deberías de usar **!help** para que te acuerdes.",
  "function": {
    "!help": {
      "explain": "Te explico como quiero que me hables, para que te pueda responder! Y si no te gusta puedes ir buscando a otra!",
      "messageHeader": "Esto es en lo que te puedo ayudar por el momento: \n\n",
      "messageFooter": "\nY si quieres saber como funciona cada uno, preguntame el comando que quieres que te explique agregando **'--explain'** después. Si te explico ahorita nunca dejaré de perder mi tiempo contigo!"
    },
    "!bot": {
      "explain": "Simplemente te contesto si puedo escucharte. Que esperabas?!",
      "message": "Llamaste?"
    },
    "!who": {
      "explain": "Selecciono a una persona al azar! Eso te puede incluir! Y-y talvez yo t-tambien..."
    },
    "!eventos": {
      "explain": "Una lista de los próximos eventos a nivel nacional",
      "loseventos" : {
        "evento" : {
          "nombre" : "**sf5**",
          "link" : "linkasft",
          "lugar" : "municipio,estado",
          "fecha" : "12/10/2020"
        },
        "evento2" : {
          "nombre" : "**sf6**",
          "link" : "linkasf6",
          "lugar" : "municipio,estado",
          "fecha" : "12/10/2020"
        },
        "evento3" : {
          "nombre" : "**sf6**",
          "link" : "linkasf6",
          "lugar" : "municipio,estado",
          "fecha" : "12/10/2020"
        }
      }
    },
    "!8ball": {
      "explain": "Preguntame algo y te respondo! No me culpes si mi respuesta no es coherente!",
      "message": [
        "Y tu quien eres?!",
        "Estas pero bien idiota!",
        "HA! Nunca!",
        "Para alguien más es facil, pero para un primate como tú es imposible!",
        "T-Talvez...",
        "Si!",
        "P-por supuesto que sí! Pero deja de preguntarme cuando todo mundo está viendo..."
      ]
    },
    "!role": {
      "explain": "Te explico el rol que tienes! Aun no funciona el comando asi que por favor contacta a un admin!",
      "permission": [
        "Admin",
        "Developers"
      ],
      "message": {
        "success": "",
        "failure": ""
      }
    }
  }
}
